{
  "backend/main.mo": "Main backend actor implementing investment tracking system with user profiles, investments, transactions, session management, and resource content; includes authorization mixin and access control with various data structures stored in Maps.",
  "feature_evidence.json": "Feature evidence report documenting three upload button improvements in the Features component: fixing flicker behavior, adding progress indicator, and displaying status messages.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend TypeScript/React files covering routing, authentication, components, hooks, configuration, and styling with focus on authentication guards and user interactions.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark mode variables for a professional financial application aesthetic using warm neutral tones.",
  "frontend/index.html": "HTML entry point for the Investment Tracker application with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup defining routes for Dashboard, Investments, Transactions (protected), Resources, and Features with authentication checks and profile setup flow.",
  "frontend/src/components/Dashboard.tsx": "Dashboard component displaying investment statistics, session state for authenticated investors, investment creation form, and recent investments with support for both authenticated and anonymous viewing modes.",
  "frontend/src/components/Features.tsx": "Component for uploading and displaying markdown feature files with search, pagination, and table view. Parses markdown content into feature items and provides file upload with progress tracking.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright year, branding with heart icon, and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, user profile display, role badge, and navigation buttons for Dashboard, Investments, Resources, Features, and Transactions. Includes LoginButton component.",
  "frontend/src/components/InvestmentCard.tsx": "Card component displaying investment details with tabs for overview and transactions. Shows transaction totals, creation date, and provides dialog for adding new transactions with authentication checks.",
  "frontend/src/components/InvestmentForm.tsx": "Form for creating new investments with fields for name, description, e-project selection (from predefined list), payment mode, and transaction IDs. Validates inputs and requires authentication.",
  "frontend/src/components/InvestmentsList.tsx": "Displays a grid of all investments in the system with loading states and empty state handling. Shows investment cards with name, description, ID, investor principal, and creation date.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with session hash finalization for investors. Shows loading states and displays appropriate icons for auth status.",
  "frontend/src/components/ProfileSetup.tsx": "Form component for user profile creation with name, email, and role (ADMIN/INVESTOR) fields, using mutation hook to save profile data.",
  "frontend/src/components/Resources.tsx": "Displays parsed markdown resource content organized by categories (Security, Core Features, Technical, Support) and importance levels with search filtering and tabbed navigation.",
  "frontend/src/components/TransactionForm.tsx": "Form component for creating transactions with fields for type, payment mode, amount, and transaction IDs, includes confirmation dialog and session management.",
  "frontend/src/components/TransactionList.tsx": "Displays a scrollable list of transactions for a specific investment with formatted amounts, types, modes, and transaction metadata.",
  "frontend/src/components/TransactionsList.tsx": "Full-page table view of all user transactions with detailed columns including type, mode, amount, IDs, timestamps, and session information.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializes access control, and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend canister interactions including user profiles, investments, transactions, resources, and session management with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes, including sidebar, chart, and UI component colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/types/features.ts": "TypeScript interface defining the FeatureItem structure with id, text, and rawLine properties.",
  "frontend/src/utils/featuresParser.ts": "Utility function that parses markdown content to extract feature items from under a 'Features/Functions:' heading, removing bullet markers and numbering.",
  "frontend/src/utils/markdownParser.ts": "Comprehensive markdown parser that extracts list items, categorizes them by section/category/importance, and provides grouped views for documentation navigation.",
  "frontend/src/utils/pagination.ts": "Generic pagination utility function that slices arrays based on page size and page number (1-based indexing).",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query parameters from both regular and hash-based routing, with sessionStorage persistence and cleanup functions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining theme extensions including custom colors using OKLCH color space, font families (Inter and JetBrains Mono), border radius variables, and keyframe animations for accordion components.",
  "project_state.json": "Project state file tracking three feature requests to fix upload button flickering, add upload progress percentage indicator, and display success/error status messages in the Features component."
}