{
  "backend/main.mo": "Main backend actor implementing user profiles, investments, transactions with session-based integrity tracking, and role-based access control using MixinAuthorization for ADMIN and INVESTOR roles.",
  "feature_evidence.json": "Feature evidence report mapping five high-confidence features (runtime errors, authentication, backend communication, session state rendering, and build issues) to their implementation files and test requirements.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend TypeScript/React components, hooks, configuration files, and styling, describing their purpose and key functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm amber/orange color palette using OKLCH color space for both light and dark themes.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Investment Tracker application.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup, authentication flow handling, conditional rendering for login/profile setup/dashboard, and Layout wrapper with Header/Footer.",
  "frontend/src/components/Dashboard.tsx": "Dashboard displaying user profile, statistics cards for investments/transactions/session buffer, Integrity & Session State section for INVESTOR users showing session hashes and latest SessionState, investment form, and recent investments grid.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice and attribution link to caffeine.ai with UTM tracking parameters based on current hostname.",
  "frontend/src/components/Header.tsx": "Application header component displaying the app logo, user profile with role badge, and navigation buttons (Dashboard, Investments, Transactions) along with a login/logout button.",
  "frontend/src/components/InvestmentCard.tsx": "Card component for displaying individual investment details with tabs for overview and transactions, showing total transaction amount, creation date, and a dialog to add new transactions.",
  "frontend/src/components/InvestmentForm.tsx": "Form component for creating new investments with name and description fields, generating unique IDs and handling submission with toast notifications.",
  "frontend/src/components/InvestmentsList.tsx": "Displays a grid of all investments in the platform with investment details including ID, investor principal, description, and creation date, with loading and empty states.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout, manages session finalization for investors, and clears query cache on logout with loading states.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation form displayed to new users, collecting name, email, and role (Admin/Investor) to initialize their user profile in the system.",
  "frontend/src/components/TransactionForm.tsx": "Form for creating transactions with type selection (recharge, invest, withdraw, etc.), amount input, and automatic session initialization with unique IDs and nonces for each transaction.",
  "frontend/src/components/TransactionList.tsx": "Displays a scrollable list of transactions for a specific investment with icons, badges, and formatted details including type, amount, nonce, and session sequence. Shows empty state when no transactions exist.",
  "frontend/src/components/TransactionsList.tsx": "Renders a comprehensive table view of all caller transactions with detailed columns including type, IDs, amount, timestamp, transaction hash, nonce, and session sequence. Includes loading state and empty state with icons.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, initializing access control with admin token from URL params and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider component with login/logout functionality, identity management, and configurable AuthClient options including derivation origin support.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including user profiles, investments, transactions, and session management with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a complete design system including light/dark theme colors for UI components, charts, and sidebar elements using oklch color space.",
  "frontend/src/main.tsx": "Application entry point that sets up the React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, font families (Inter, JetBrains Mono), container settings, and animation keyframes.",
  "project_state.json": "Project state file documenting a fix request for frontend runtime errors, with features tracking investigation of authentication, actor initialization, and rendering issues."
}