{
  "backend/main.mo": "Main Motoko actor implementing investment tracking with user profiles, investments, and transactions; includes access control, session-based transaction tracking with nonce generation, and a buffer storing the last 6 transaction hashes per investor session.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, hooks, configuration, and styling for the investment tracker application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes using warm neutral tones, plus base layer styles for consistent theming.",
  "frontend/index.html": "HTML entry point that loads the React application from /src/main.tsx with basic meta tags and a root div.",
  "frontend/src/App.tsx": "Root React component managing authentication flow with Internet Identity, profile setup for new users, and TanStack Router configuration for dashboard, investments, and transactions routes.",
  "frontend/src/components/Dashboard.tsx": "Dashboard page displaying user profile card, summary statistics (investments, transactions, total amount), session transaction hashes card with scrollable list, and recent investments grid with dialog for creating new investments.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice with current year and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Application header with logo, user welcome message showing name and formatted role badge, navigation menu for dashboard/investments/transactions pages, and login/logout button.",
  "frontend/src/components/InvestmentCard.tsx": "Displays a single investment with tabs for overview and transactions, showing total transaction amount, creation date, and a dialog to add new transactions.",
  "frontend/src/components/InvestmentForm.tsx": "Form component for creating new investments with name and description fields, generating a unique ID and calling the createInvestment mutation.",
  "frontend/src/components/InvestmentsList.tsx": "Displays a grid of all investments in the system with their details (ID, investor, description, creation date) or an empty state if none exist.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that toggles between login and logout states using Internet Identity, clearing the query cache on logout.",
  "frontend/src/components/ProfileSetup.tsx": "Form for new users to create their profile with name, email, and role (ADMIN or INVESTOR) fields.",
  "frontend/src/components/TransactionForm.tsx": "Form for creating transactions with amount and type selection, generating a unique ID and placeholder hash for the transaction.",
  "frontend/src/components/TransactionList.tsx": "Displays a scrollable list of transactions with icons, amounts, types, nonces, and session sequences, or an empty state if no transactions exist.",
  "frontend/src/components/TransactionsList.tsx": "React component that displays a paginated table of user transactions with filtering, sorting, and formatting for transaction types, amounts, timestamps, and IDs. Uses useGetCallerTransactions hook to fetch data and renders loading/empty states with icons and badges.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes, and initializes access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence via AuthClient, and delegation validation. Provides login/logout functions and status tracking (initializing, idle, logging-in, success, error) throughout the authentication lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, investments, and transactions, wrapping backend actor calls with caching and automatic invalidation. Provides queries (useGetCallerUserProfile, useGetAllInvestments, useGetCallerTransactions) and mutations (useSaveCallerUserProfile, useCreateInvestment, useCreateTransaction) with proper dependency management.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a comprehensive design system including colors for light/dark themes, spacing (radius), and semantic tokens for UI elements (background, foreground, primary, secondary, muted, accent, destructive, borders, charts, sidebar). Applies base styles to body with font feature settings.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClientProvider for React Query state management and InternetIdentityProvider for authentication context. Imports global CSS styles and mounts the App component to the DOM.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support. Includes functions to get, store, clear, and persist parameters across navigation, plus clearParamFromHash to remove sensitive data from the address bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining theme extensions including custom colors using OKLCH color space, font families (Inter, JetBrains Mono), container settings, border radius variables, and keyframe animations for accordions.",
  "project_state.json": "Project state tracking file containing six pending feature requests (AR-1 through AR-6) focused on implementing an in-memory session buffer to store the last 6 transaction hashes per investor with FIFO logic and a read-only API endpoint to retrieve them."
}