{
  "backend/main.mo": "Main backend actor implementing investment tracking with user profiles, investments, transactions, and session state management. Includes authorization controls, migration support, and methods for creating/querying investments and transactions with new fields (eProject, mode, txnIdNat, txnIdText).",
  "backend/migration.mo": "Migration module that transforms old actor state to new schema by adding eProject field to investments and mode, txnIdNat, txnIdText fields to transactions with default values.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: admin-only e-projects dropdown with 38 secoinfi-apps options, mode dropdown for transactions, dual transaction ID fields (Nat and Text), and payment verification notice with UPI/WhatsApp/Ethereum details.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend files including components, hooks, configuration, and styling with descriptions of their functionality and recent additions.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark modes using warm amber/orange tones for a professional financial application aesthetic.",
  "frontend/index.html": "HTML entry point with viewport meta tag, 'Investment Tracker' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main application component with TanStack Router setup, authentication flow handling, profile setup for new users, and three routes (index/dashboard, investments list, transactions list) wrapped in Layout with Header and Footer.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard component displaying user profile, investment statistics (total investments, transactions, session buffer), and integrity/session state information with navigation to detailed views.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright information and a link to caffeine.ai with dynamic year and app identifier.",
  "frontend/src/components/Header.tsx": "Application header with branding, user profile display, role badge, navigation buttons (Dashboard, Investments, Transactions), and login/logout functionality.",
  "frontend/src/components/InvestmentCard.tsx": "Card component displaying individual investment details with tabs for overview and transactions, including total transaction amount, creation date, and ability to add new transactions via dialog.",
  "frontend/src/components/InvestmentForm.tsx": "Form component for creating new investments with name, description, and optional e-project selection (admin-only feature) from a predefined list of 37 e-projects.",
  "frontend/src/components/InvestmentsList.tsx": "Displays a grid of all investments in the platform with investment details including ID, investor principal, description, and creation timestamp.",
  "frontend/src/components/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with special session finalization logic for investors, including loading states and error handling with toast notifications.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form component that collects user name, email, and role (ADMIN/INVESTOR) and saves it using the useSaveCallerUserProfile hook. Displays validation errors and success messages via toast notifications.",
  "frontend/src/components/TransactionForm.tsx": "Transaction creation form that handles investment transactions with amount, type, payment mode, and transaction IDs. Initializes a session on mount, validates inputs, and shows a confirmation dialog before submitting transactions with generated hashes.",
  "frontend/src/components/TransactionList.tsx": "Displays a scrollable list of transactions for a specific investment with icons, badges for type/mode, and detailed transaction metadata including nonce, session sequence, and transaction IDs. Shows empty state when no transactions exist.",
  "frontend/src/components/TransactionsList.tsx": "Full-page transaction list component that fetches all caller transactions and displays them in a detailed table with columns for type, mode, amount, IDs, timestamps, and other metadata. Includes loading state and empty state handling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token from URL parameters and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking. Creates AuthClient with configurable options and handles identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for managing user profiles, investments, and transactions with CRUD operations and cache invalidation. Includes hooks for admin checks, investment lists, and transaction history retrieval.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space. Defines design tokens for colors, borders, charts, and sidebar components.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers. Renders the main App component with necessary context providers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing. Includes sessionStorage persistence and parameter cleanup functionality.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom theme extensions including OKLCH color system, typography, container queries, and animations. Defines font families, color tokens, border radius, and keyframe animations.",
  "project_state.json": "Project state document describing an investment management platform with e-project deposit tracking, multi-mode payment verification (GPay, Crypto, CBDC, Wallets), and admin-controlled features. Lists 38 secoinfi-apps options and payment verification flow requirements."
}