{
  "backend/main.mo": "Main backend actor implementing investment tracking with user profiles, investments, transactions, and session state management. Includes authorization mixin, migration support, and methods for creating/querying investments and transactions with new fields (eProject, mode, txnIdNat, txnIdText).",
  "backend/migration.mo": "Migration module that transforms old Investment records to new format by adding mode, txnIdNat, and txnIdText fields with default values.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features in InvestmentForm: e-project dropdown (38 options), mode select (4 options), transaction ID fields (numeric and text), and payment notice section with UPI/WhatsApp/Ethereum details.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components (Dashboard, InvestmentForm, TransactionForm with extended payment modes and transaction IDs), hooks, configuration, and styling with warm amber/orange color scheme.",
  "frontend/index.css": "Global CSS with Tailwind directives and OKLCH color system defining light and dark mode variables using neutral grayscale tones for background, foreground, borders, and UI elements.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Investment Tracker application.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup, authentication flow with loading states, profile setup handling, and Layout wrapper with Header/Footer for three routes: index (Dashboard), investments list, and transactions list.",
  "frontend/src/components/Dashboard.tsx": "Dashboard displaying user profile, statistics cards (investments, transactions, session buffer), Integrity & Session State section for investors showing session buffer and latest SessionState, investment form, and recent investments grid.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice with current year and attribution link to caffeine.ai with UTM tracking parameters based on hostname.",
  "frontend/src/components/Header.tsx": "Header component displaying app branding, user profile with role badge, and navigation buttons for Dashboard, Investments, and Transactions pages, plus a login button.",
  "frontend/src/components/InvestmentCard.tsx": "Card component for displaying individual investment details with tabs for overview (total transactions, creation date) and transaction list, includes dialog for adding new transactions.",
  "frontend/src/components/InvestmentForm.tsx": "Form component for creating new investments with fields for name, description, e-project selection (from predefined list), payment mode, and transaction IDs (numeric and optional text).",
  "frontend/src/components/InvestmentsList.tsx": "Displays a grid of all investments in the platform with investment ID, investor principal, and creation timestamp; shows loading state and empty state.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout, updates session hashes for investors on logout, and manages query cache invalidation.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation form for new users to enter name, email, and select role (Admin or Investor) before accessing the application.",
  "frontend/src/components/TransactionForm.tsx": "Form for creating transactions with amount, type (recharge/withdrawal), payment mode selection, transaction IDs, and session management; includes confirmation dialog before submission.",
  "frontend/src/components/TransactionList.tsx": "Displays a scrollable list of transactions for a specific investment with icons, badges, and detailed metadata including nonce, session sequence, and transaction IDs.",
  "frontend/src/components/TransactionsList.tsx": "Renders a comprehensive table view of all caller transactions with formatted dates, transaction types, amounts, and detailed metadata columns.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality with AuthClient integration and identity state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, investments, transactions, and session state with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes including sidebar, charts, and UI component tokens.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider wrappers around the main App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, font families (Inter, JetBrains Mono), container settings, border radius variables, and keyframe animations for accordions.",
  "project_state.json": "Project state tracking document describing an investment platform with enhanced create investment form supporting multiple payment modes (GPay, Crypto, CBDC, Wallets), e-project selection dropdown, transaction ID fields, and payment notice section with UPI/WhatsApp/ETH details."
}