{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Extend Create Investment with e-Projects Deposits and Multi-Mode Transaction Verification",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add ADMIN-only e-projects dropdown to InvestmentForm with 38 secoinfi-apps options",
      "acceptanceCriteria": [
        "Dropdown is visible in InvestmentForm only when user role is ADMIN",
        "All 38 e-project options are available in the dropdown",
        "Selected e-project value is stored with the investment"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/InvestmentForm.tsx",
          "operation": "modify",
          "description": "Add a 'Default Deposits on e-Projects' dropdown field with 38 secoinfi-apps options (e-contract-lwf, e-contracts-bqe, etutorial-lgc, etutorials-cso, evolved-ai-o6e, forms-sxn, geo-map-w9s, golden-sec-vri, ia-niqaw-947, icp-cloud-storage-hvk, infi-loop-1au, infytask-mia, ipfs-lrm, key-unlock-5hx, map-56b, moap-app-6ag, multi-apps-unify-app-hbc, n8n-tasks-c2i, n8n-workflows-6sy, networth-htm, op-hotels-rests-ae0, pvt-projects-7wo, sec-build-0bj, sec-epay-am0, sec-jewelry-j03, secoin-ep6, sitemap-hub-fe2, sitemap-hub-sy0, sitemap-nya, sitemap-subs-app-j3h, sitemaps-fwh, sudeep-hotels-eu8, terror-uproot-97d, trends-63c, trends-d1l, voice-invoice-au1, xcaller-0aw, yo-data-app-o7u). Use the authorization component to check if the current user has ADMIN role via isCallerAdmin() query before showing this field. Store the selected e-project value in the form state and pass it to createInvestment backend call as the eProject parameter. Add a Select component from shadcn/ui for the dropdown."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add required Mode dropdown to TransactionForm with payment method options",
      "acceptanceCriteria": [
        "Mode dropdown appears in TransactionForm with 4 options",
        "Mode selection is required before transaction submission",
        "Selected mode is included in transaction data"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TransactionForm.tsx",
          "operation": "modify",
          "description": "Add a required 'Mode' dropdown field using Select component from shadcn/ui with four options: GPay, Crypto, CBDC, Wallets. Add mode to the form state and validation to ensure it is selected before submission. Pass the mode value to the createTransaction backend call as the mode parameter."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add transaction ID fields to TransactionForm: required numeric Txn ID and optional text Txn ID",
      "acceptanceCriteria": [
        "Numeric Txn ID field accepts only natural numbers and is required",
        "Text Txn ID field accepts alphanumeric strings and is optional",
        "Both fields are submitted with transaction data"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TransactionForm.tsx",
          "operation": "modify",
          "description": "Add two transaction ID input fields: a required 'Txn ID' numeric input field that accepts only positive integers (to be passed as txnIdNat of type Nat to the backend) and an optional 'Txn ID (Text)' text input field (to be passed as txnIdText). Add validation to ensure the numeric field contains only valid natural numbers. Include both fields in the form state and pass them to createTransaction backend call as txnIdNat and txnIdText parameters."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Display transaction verification notice with UPI, WhatsApp, and Ethereum payment instructions",
      "acceptanceCriteria": [
        "Notice is displayed prominently in TransactionForm",
        "UPI account 'secoin@uboi' is included in the notice",
        "WhatsApp link https://wa.me/919620058644 is clickable",
        "Ethereum address 0x4a100E184ac1f17491Fbbcf549CeBfB676694eF7 is displayed",
        "Notice reminds users to verify details before submission"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TransactionForm.tsx",
          "operation": "modify",
          "description": "Add a prominent notice section at the top or middle of the TransactionForm displaying the following message: 'After successful Deposit to Our UPI A/c: secoin@uboi, Pl. verify the Trn ID by submitting details here & Send a Copy by Chat to https://wa.me/919620058644. Include Crypto Deposits receipts as Txn ID after sending Ethereum on ERC20 Mainnet to Our Eth ID: 0x4a100E184ac1f17491Fbbcf549CeBfB676694eF7. Pl. Recheck & Verify if Details to be Submitted is Correct.' Use an Alert or Card component from shadcn/ui with info/warning styling. Make the WhatsApp link clickable with target='_blank' and rel='noopener noreferrer'."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add confirmation dialog to TransactionForm for reviewing transaction details before submission",
      "acceptanceCriteria": [
        "User can review all transaction details before submission",
        "Confirmation step includes mode, both transaction IDs, amount, and type",
        "User must explicitly confirm before transaction is created"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TransactionForm.tsx",
          "operation": "modify",
          "description": "Add a confirmation dialog using AlertDialog component from shadcn/ui that displays all entered transaction details (transaction type, mode, amount, numeric transaction ID, text transaction ID if provided) before final submission. Trigger this dialog when the user clicks the submit button. In the dialog, show all fields with their values in a readable format and include 'Confirm' and 'Cancel' buttons. Only call createTransaction after the user clicks 'Confirm' in the dialog."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Update transaction list components to display new mode and transaction ID fields",
      "acceptanceCriteria": [
        "Transaction list displays payment mode for each transaction",
        "Both transaction ID fields are visible when available",
        "Layout accommodates new fields without breaking existing display"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TransactionList.tsx",
          "operation": "modify",
          "description": "Add display of the new transaction fields: mode, txnIdNat (numeric transaction ID), and txnIdText (optional text transaction ID). Update the transaction list item layout to include these fields alongside existing details. Use Badge component for displaying the mode. Show both transaction IDs with appropriate labels, displaying txnIdText only when it has a value."
        },
        {
          "path": "frontend/src/components/TransactionsList.tsx",
          "operation": "modify",
          "description": "Add three new columns to the transactions table: 'Mode' displaying the payment mode as a Badge, 'Txn ID (Nat)' showing the numeric transaction ID, and 'Txn ID (Text)' showing the optional text transaction ID when present. Update the table headers and data rows to include these fields while maintaining the existing table layout and responsiveness."
        }
      ]
    }
  ]
}